In [1]:
import  pandas as pd

In [17]:
df = pd.read_csv("C:/Users/Savita Seharawat/Desktop/data sets/titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [5]:
df.tail(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [6]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [8]:
df.shape

(891, 12)

In [10]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [33]:
df.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [9]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [13]:
(687/891)*100

77.10437710437711

In [16]:
df.shape

(183, 12)

In [34]:
df = df.drop("Cabin",axis = 1)

In [35]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Embarked'],
      dtype='object')

In [36]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [38]:
df["Age"].mean()

29.69911764705882

In [ ]:
3,5,7,NA,10,12

In [39]:
(3+5+7+10+12)/5

7.4

In [13]:
df["Age"]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [40]:
round(df["Age"].mean(),0)

30.0

In [43]:
mean_Age = round(df["Age"].mean(),0)

In [41]:
df.loc[df["Age"].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,Q
...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,S

In [44]:
df["Age"] = df["Age"].fillna(value = mean_Age)

In [45]:
df["Age"]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    30.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [46]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [47]:
df.loc[df["Embarked"].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,NaN

In [48]:
df = df.dropna()

In [49]:
df.shape

(889, 11)

In [50]:
df.isnull().sum().sum()

0

In [22]:
df.shape

(889, 11)

In [51]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Embarked        object
dtype: object

In [52]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C

In [53]:
df = df.drop(["Name",'Ticket','PassengerId'] , axis = 1)

In [54]:
df.head(2)

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C

In [26]:
df["Sex"].unique()

array(['male', 'female'], dtype=object)

In [55]:
df["Sex"] = df["Sex"].astype("category")

In [56]:
df["Sex"].dtype

CategoricalDtype(categories=['female', 'male'], ordered=False)

In [57]:
df["Embarked"] = df["Embarked"].astype("category")

In [58]:
df.dtypes

Survived       int64
Pclass         int64
Sex         category
Age          float64
SibSp          int64
Parch          int64
Fare         float64
Embarked    category
dtype: object

In [59]:
df.head(2)

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C

In [31]:
(687/891)*100

77.10437710437711

In [32]:
df.head(2)

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C

In [60]:
dfx = df.drop("Survived" , axis =1)

In [61]:
dfx.head(3)

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  22.0      1      0   7.2500        S
1       1  female  38.0      1      0  71.2833        C
2       3  female  26.0      0      0   7.9250        S

In [62]:
df["Survived"]

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 889, dtype: int64

In [63]:
dfy = df["Survived"]

In [37]:
dfy.head(5)

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [64]:
dfx.dtypes

Pclass         int64
Sex         category
Age          float64
SibSp          int64
Parch          int64
Fare         float64
Embarked    category
dtype: object

In [65]:
dfx.describe().T.round(0)

        count  mean   std  min   25%   50%   75%    max
Pclass  889.0   2.0   1.0  1.0   2.0   3.0   3.0    3.0
Age     889.0  30.0  13.0  0.0  22.0  30.0  35.0   80.0
SibSp   889.0   1.0   1.0  0.0   0.0   0.0   1.0    8.0
Parch   889.0   0.0   1.0  0.0   0.0   0.0   0.0    6.0
Fare    889.0  32.0  50.0  0.0   8.0  14.0  31.0  512.0

In [40]:
dfx.head(5)

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  22.0      1      0   7.2500        S
1       1  female  38.0      1      0  71.2833        C
2       3  female  26.0      0      0   7.9250        S
3       1  female  35.0      1      0  53.1000        S
4       3    male  35.0      0      0   8.0500        S

# Normalize the data set :

##### Normalization is generally required when we are dealing with attributes on a different scale, otherwise, it may lead to a dilution in the effectiveness of an important equally important attribute
##### (on a lower scale) because of other attributes having values on a larger scale. In simple words, when multiple attributes are there but attributes have values on different scales, 
##### this may lead to poor data models while performing data mining operations. So they are normalized to bring all the attributes on the same scale.

##  Min-Max Scaling:

##### Min-Max normalization: In this technique of data normalization, a linear transformation is performed on the original data.
##### The minimum and maximum value from data are fetched and each value is replaced according to the following formula.

In [ ]:
x = (x - min)/(max - min)

In [22]:
a = [1,2,3]
b = [11,12,13]

In [6]:
p = (13 - 11)/(13-11)
p

1.0

a = [0,0.5,1]
b = [0,0.5,1]

In [80]:
dfx.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  22.0      1      0   7.2500        S
1       1  female  38.0      1      0  71.2833        C
2       3  female  26.0      0      0   7.9250        S
3       1  female  35.0      1      0  53.1000        S
4       3    male  35.0      0      0   8.0500        S

In [50]:
dfx.dtypes

Pclass         int64
Sex         category
Age          float64
SibSp          int64
Parch          int64
Fare         float64
Embarked    category
dtype: object

In [66]:
dfx = dfx.drop(["Sex", "Embarked"] ,axis =1)

In [42]:
dfx.head(2)

   Pclass   Age  SibSp  Parch     Fare
0       3  22.0      1      0   7.2500
1       1  38.0      1      0  71.2833

In [68]:
from sklearn.preprocessing import MinMaxScaler

In [69]:
scaler = MinMaxScaler()

In [70]:
scaler.fit_transform(dfx)

array([[1.        , 0.27117366, 0.125     , 0.        , 0.01415106],
       [0.        , 0.4722292 , 0.125     , 0.        , 0.13913574],
       [1.        , 0.32143755, 0.        , 0.        , 0.01546857],
       ...,
       [1.        , 0.37170143, 0.125     , 0.33333333, 0.04577135],
       [0.        , 0.32143755, 0.        , 0.        , 0.0585561 ],
       [1.        , 0.39683338, 0.        , 0.        , 0.01512699]])

In [74]:
pd.DataFrame(scaler.fit_transform(dfx),columns = dfx.columns)

     Pclass       Age  SibSp     Parch      Fare
0       1.0  0.271174  0.125  0.000000  0.014151
1       0.0  0.472229  0.125  0.000000  0.139136
2       1.0  0.321438  0.000  0.000000  0.015469
3       0.0  0.434531  0.125  0.000000  0.103644
4       1.0  0.434531  0.000  0.000000  0.015713
..      ...       ...    ...       ...       ...
884     0.5  0.334004  0.000  0.000000  0.025374
885     0.0  0.233476  0.000  0.000000  0.058556
886     1.0  0.371701  0.125  0.333333  0.045771
887     0.0  0.321438  0.000  0.000000  0.058556
888     1.0  0.396833  0.000  0.000000  0.015127

[889 rows x 5 columns]

In [111]:
scaler_dfx = pd.DataFrame(scaler.fit_transform(dfx),columns = dfx.columns)

In [82]:
scaler_dfx.head(20)

    Pclass       Age  SibSp     Parch      Fare
0      1.0  0.271174  0.125  0.000000  0.014151
1      0.0  0.472229  0.125  0.000000  0.139136
2      1.0  0.321438  0.000  0.000000  0.015469
3      0.0  0.434531  0.125  0.000000  0.103644
4      1.0  0.434531  0.000  0.000000  0.015713
5      1.0  0.371701  0.000  0.000000  0.016510
6      0.0  0.673285  0.000  0.000000  0.101229
7      1.0  0.019854  0.375  0.166667  0.041136
8      1.0  0.334004  0.000  0.333333  0.021731
9      0.5  0.170646  0.125  0.000000  0.058694
10     1.0  0.044986  0.125  0.166667  0.032596
11     0.0  0.723549  0.000  0.000000  0.051822
12     1.0  0.246042  0.000  0.000000  0.015713
13     1.0  0.484795  0.125  0.833333  0.061045
14     1.0  0.170646  0.000  0.000000  0.015330
15     0.5  0.685851  0.000  0.000000  0.031230
16     1.0  0.019854  0.500  0.166667  0.056848
17     0.5  0.371701  0.000  0.000000  0.025374
18     1.0  0.384267  0.125  0.000000  0.035134
19     1.0  0.371701  0.000  0.000000  0.014102

In [84]:
dfy.head(20)

0     0
1     1
2     1
3     1
4     0
5     0
6     0
7     0
8     1
9     1
10    1
11    1
12    0
13    0
14    0
15    1
16    0
17    1
18    0
19    1
Name: Survived, dtype: int64

In [100]:
output_test

9    1
5    0
Name: Survived, dtype: int64

In [77]:
scaler_dfx.describe().T

        count      mean       std  min       25%       50%       75%  max
Pclass  889.0  0.655793  0.417350  0.0  0.500000  1.000000  1.000000  1.0
Age     889.0  0.368099  0.162970  0.0  0.271174  0.371701  0.434531  1.0
SibSp   889.0  0.065523  0.137963  0.0  0.000000  0.000000  0.125000  1.0
Parch   889.0  0.063742  0.134460  0.0  0.000000  0.000000  0.000000  1.0
Fare    889.0  0.062649  0.097003  0.0  0.015412  0.028213  0.060508  1.0

In [51]:
scaler_dfx.describe().T.round(1)

        count  mean  std  min  25%  50%  75%  max
Pclass  889.0   0.7  0.4  0.0  0.5  1.0  1.0  1.0
Age     889.0   0.4  0.2  0.0  0.3  0.4  0.4  1.0
SibSp   889.0   0.1  0.1  0.0  0.0  0.0  0.1  1.0
Parch   889.0   0.1  0.1  0.0  0.0  0.0  0.0  1.0
Fare    889.0   0.1  0.1  0.0  0.0  0.0  0.1  1.0

In [78]:
from sklearn.model_selection import train_test_split

In [86]:
(889*20)/100

177.8

In [112]:
input_train,input_test,output_train,output_test = train_test_split(scaler_dfx,dfy,test_size = 0.2, random_state = 5)

In [113]:
input_train.shape[0]

711

In [64]:
output_test

127    1
355    0
698    0
538    0
851    0
      ..
616    0
732    0
42     0
180    0
124    0
Name: Survived, Length: 178, dtype: int64

In [121]:
input_test

     Pclass       Age  SibSp     Parch      Fare
126     1.0  0.296306  0.000  0.000000  0.013940
354     1.0  0.346569  0.000  0.000000  0.018543
697     0.0  0.610455  0.125  0.166667  0.216430
537     1.0  0.371701  0.000  0.000000  0.028302
849     1.0  0.924604  0.000  0.000000  0.015176
..      ...       ...    ...       ...       ...
615     1.0  0.421965  0.125  0.166667  0.028107
731     0.5  0.371701  0.000  0.000000  0.000000
42      1.0  0.371701  0.000  0.000000  0.015412
179     1.0  0.371701  1.000  0.333333  0.135753
123     0.0  0.673285  0.000  0.166667  0.150855

[178 rows x 5 columns]

In [66]:
dfx.shape

(889, 5)

In [68]:
889*0.2

177.8

In [57]:
output_train

682    0
887    1
470    0
505    0
135    0
      ..
401    0
119    0
702    0
207    1
869    1
Name: Survived, Length: 711, dtype: int64

# KNN  algorithm

In [114]:
from sklearn.neighbors import KNeighborsClassifier

In [115]:
KNN = KNeighborsClassifier()
KNN

KNeighborsClassifier()

In [116]:
Knn = KNN.fit(input_train,output_train)
Knn

KNeighborsClassifier()

In [117]:
pred_test = Knn.predict(input_test)
pred_test

C:\Users\Savita Seharawat\anaconda3\lib\site-packages\sklearn\neighbors\_classification.py:228: FutureWarning: Unlike other reduction functions (e.g. `skew`, `kurtosis`), the default behavior of `mode` typically preserves the axis it acts along. In SciPy 1.11.0, this behavior will change: the default value of `keepdims` will become False, the `axis` over which the statistic is taken will be eliminated, and the value None will no longer be accepted. Set `keepdims` to True or False to avoid this warning.
  mode, _ = stats.mode(_y[neigh_ind, k], axis=1)

array([0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0,
       1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0,
       0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 0, 0,
       0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0,
       1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0,
       0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0,
       0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 1], dtype=int64)

In [118]:
output_test

127    1
355    0
698    0
538    0
851    0
      ..
616    0
732    0
42     0
180    0
124    0
Name: Survived, Length: 178, dtype: int64

In [119]:
from sklearn.metrics import accuracy_score

In [120]:
accuracy_score_knn = round(accuracy_score(output_test,pred_test)*100,0)
accuracy_score_knn

69.0

## Logistic Regression

In [66]:
from sklearn.linear_model import LogisticRegression

In [67]:
model = LogisticRegression()
Model = model.fit(input_train,output_train)
predict_logistic=Model.predict(input_test)

In [68]:
predict_logistic

array([0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0,
       1, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0,
       0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0,
       0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1,
       1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0,
       1, 1, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0,
       0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 1], dtype=int64)

In [69]:
output_test

127    1
355    0
698    0
538    0
851    0
      ..
616    0
732    0
42     0
180    0
124    0
Name: Survived, Length: 178, dtype: int64

In [72]:
from sklearn.metrics import accuracy_score

In [77]:
accuracy_score_LogisticRegression = round(accuracy_score(output_test,predict_logistic)*100,0)
accuracy_score_LogisticRegression

70.0